//bit14_detail.h

#pragma once

/*=================================================================================
===================================================================================
|||	MIT License
|||
|||	Copyright (c) 2024, agrem44@gmail.com
|||
|||	Permission is hereby granted, free of charge, to any person obtaining a copy
|||	of this software and associated documentation files (the "Software"), to deal
|||	in the Software without restriction, including without limitation the rights
|||	to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
|||	copies of the Software, and to permit persons to whom the Software is
|||	furnished to do so, subject to the following conditions:
|||
|||	The above copyright notice and this permission notice shall be included in all
|||	copies or substantial portions of the Software.
|||
|||	THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
|||	IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
|||	FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
|||	AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
|||	LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
|||	OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
|||	SOFTWARE.
===================================================================================
===================================================================================*/

#include <cstdint>			//uint8_t, uint16_t, uint32_t, uint64_t, int32_t
#include <type_traits>		//true_type, false_type, is_integral, conditional, is_trivially_copyable, is_same,
								//remove_cv, has_unique_object_representations_v
#include <limits>			//numeric_limits
#include <utility>			//swap
#include <array>			//array
#include "bit14_cpuinfo.h"
#include "bit14_preprocessor.h"

#define BIT14_POPCOUNT_FALLBACK
#define BIT14_COUNTR_ZERO_FALLBACK
#define BIT14_COUNTL_ZERO_FALLBACK
#define BIT14_ROTL_FALLBACK
#define BIT14_ROTR_FALLBACK
#define BIT14_BYTESWAP_FALLBACK

#ifdef BIT14_USING_MSVC
#include <intrin.h>
#endif

#if defined(BIT14_USING_ICC) || defined(BIT14_USING_ICPX)
#include <immintrin.h>
#endif

namespace bit14
{
	using std::numeric_limits;
	using std::uint8_t;
	using std::uint16_t;
	using std::uint32_t;
	using std::uint64_t;
	using std::int32_t;

	namespace detail
	{
		static_assert(sizeof(unsigned char) == 1,
			"Unsupported bit width of type unsigned char.\n");
		static_assert(sizeof(unsigned short) == 2,
			"Unsupported bit width of type unsigned short.\n");
		static_assert(sizeof(unsigned int) == 4,
			"Unsupported bit width of type unsigned int.\n");
		static_assert(sizeof(unsigned long) == 4 || sizeof(unsigned long) == 8,
			"Unsupported bit width of type unsigned long.\n");
		static_assert(sizeof(unsigned long long) == 8,
			"Unsupported bit width of type unsigned long long.\n");

		template <typename T>
		constexpr bool always_false = false;

		template <bool b>
		struct t_or_f_type : public std::conditional<b, std::true_type, std::false_type>::type {};

		template <typename T>
		struct is_bit14_type : public std::false_type {};

		template <>
		struct is_bit14_type<unsigned char> : public std::true_type {};

		template <>
		struct is_bit14_type<unsigned short> : public std::true_type {};

		template <>
		struct is_bit14_type<unsigned int> : public std::true_type {};

		template <>
		struct is_bit14_type<unsigned long> : public std::true_type {};

		template <>
		struct is_bit14_type<unsigned long long> : public std::true_type {};

		template <typename T>
		struct is_bit14_8_bit_type : public t_or_f_type<is_bit14_type<T>::value &&
			numeric_limits<T>::digits == 8>::type {};

		template <typename T>
